#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Version constraints inside provider configuration blocks are deprecated

  on github/providers.tf line 2, in provider "github":
   2:   version      = "4.1.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Success! The configuration is valid, but there were some validation warnings as shown above.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.github.github_team.jeffrey: Refreshing state... [id=4211302]
module.github.module.noeamiot.github_membership.membership: Refreshing state... [id=SiMDE-Projects:noeamiot]
module.github.github_repository.terraform: Refreshing state... [id=terraform]
module.github.github_repository.jeffrey: Refreshing state... [id=jeffrey]
module.github.github_team.simde: Refreshing state... [id=4217733]
module.github.module.matthieudecaux.github_membership.membership: Refreshing state... [id=SiMDE-Projects:matthieudecaux]
module.github.module.huetremy.github_membership.membership: Refreshing state... [id=SiMDE-Projects:huetremy]
module.github.module.anto2oo.github_membership.membership: Refreshing state... [id=SiMDE-Projects:anto2oo]
module.github.github_team.flairsou: Refreshing state... [id=4276153]
module.github.module.cesar-richard.github_membership.membership: Refreshing state... [id=SiMDE-Projects:cesar-richard]
module.github.github_repository.jeffreyApi: Refreshing state... [id=jeffrey-api]
module.github.github_repository.flairsou: Refreshing state... [id=flairsou]
module.github.module.maxime-vaillant.github_membership.membership: Refreshing state... [id=SiMDE-Projects:maxime-vaillant]
module.github.github_repository_project.jeffrey_main: Refreshing state... [id=5787333]
module.github.github_team_repository.jeffrey_jeffrey: Refreshing state... [id=4211302:jeffrey]
module.github.github_team_repository.simde_jeffrey: Refreshing state... [id=4217733:jeffrey]
module.github.github_branch_protection.jeffrey_master: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTY5NjU=]
module.discord_simde.discord_server.server: Refreshing state... [id=759778767831957535]
module.github.github_issue_label.terraform_toApply: Refreshing state... [id=terraform:To Apply]
module.github.github_repository_project.jeffreyApi_main: Refreshing state... [id=5787347]
module.github.github_issue_label.terraform_applied: Refreshing state... [id=terraform:Applied]
module.github.github_branch_protection.jeffreyApi_master: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTY5NjY=]
module.github.github_team_repository.simde_terraform: Refreshing state... [id=4217733:terraform]
module.github.github_team_repository.simde_jeffreyApi: Refreshing state... [id=4217733:jeffrey-api]
module.github.github_team_repository.jeffrey_jeffreyApi: Refreshing state... [id=4211302:jeffrey-api]
module.github.github_branch_default.jeffreyApi: Refreshing state... [id=jeffrey-api]
module.github.github_branch_protection.terraform_main: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTY5OTk=]
module.github.github_team_repository.simde_flairsou: Refreshing state... [id=4217733:flairsou]
module.github.github_team_repository.flairsou: Refreshing state... [id=4276153:flairsou]
module.github.github_branch_protection.flairsou_master: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTcwMDE=]
module.github.github_repository_project.flairsou_main: Refreshing state... [id=5920244]
module.github.module.anto2oo.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:anto2oo]
module.github.module.maxime-vaillant.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:maxime-vaillant]
module.github.module.noeamiot.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:noeamiot]
module.github.module.noeamiot.github_team_membership.membership["simde"]: Refreshing state... [id=4217733:noeamiot]
module.github.module.cesar-richard.github_team_membership.membership["simde"]: Refreshing state... [id=4217733:cesar-richard]
module.github.module.cesar-richard.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:cesar-richard]
module.github.module.huetremy.github_team_membership.membership["flairsou"]: Refreshing state... [id=4276153:huetremy]
module.github.module.matthieudecaux.github_team_membership.membership["flairsou"]: Refreshing state... [id=4276153:matthieudecaux]
module.github.github_branch_default.jeffrey: Refreshing state... [id=jeffrey]
module.github.github_branch_default.terraform: Refreshing state... [id=terraform]
module.discord_simde.discord_role.respinfo: Refreshing state... [id=781934406292996116]
module.discord_simde.discord_role_everyone.everyone: Refreshing state... [id=759778767831957535]
module.github.github_project_column.jeffrey_main_doing: Refreshing state... [id=11462385]
module.github.github_project_column.jeffrey_main_todo: Refreshing state... [id=11462387]
module.github.github_project_column.jeffrey_main_codeReview: Refreshing state... [id=11462392]
module.github.github_project_column.jeffrey_main_approved: Refreshing state... [id=11541989]
module.github.github_project_column.jeffrey_main_done: Refreshing state... [id=11462393]
module.github.github_project_column.jeffreyApi_main_todo: Refreshing state... [id=11462388]
module.github.github_project_column.jeffreyApi_main_approved: Refreshing state... [id=11541988]
module.github.github_project_column.jeffreyApi_main_doing: Refreshing state... [id=11462394]
module.github.github_project_column.jeffreyApi_main_done: Refreshing state... [id=11462386]
module.github.github_project_column.jeffreyApi_main_codeReview: Refreshing state... [id=11462396]
module.discord_simde.module.general.discord_category_channel.category: Refreshing state... [id=778331758302593074]
module.github.github_project_column.flairsou_main_approved: Refreshing state... [id=11726488]
module.github.github_project_column.flairsou_main_codeReview: Refreshing state... [id=11726486]
module.github.github_project_column.flairsou_main_done: Refreshing state... [id=11726484]
module.github.github_project_column.flairsou_main_doing: Refreshing state... [id=11726485]
module.github.github_project_column.flairsou_main_todo: Refreshing state... [id=11726487]
module.discord_simde.discord_role.member: Refreshing state... [id=759778776560828447]
module.discord_simde.module.general.discord_text_channel.text: Refreshing state... [id=759903967211028490]
module.discord_simde.module.lucas_richard.discord_member_roles.member_role["781934406292996116"]: Refreshing state... [id=1486613506]
module.discord_simde.discord_text_channel.notifications: Refreshing state... [id=778636669737369651]
module.discord_simde.discord_text_channel.games: Refreshing state... [id=781925726840553514]
module.discord_simde.module.armand_ribault.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=693075349]
module.discord_simde.module.BWRCat.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=1961962676]
module.discord_simde.module.private-treso.discord_category_channel.category: Refreshing state... [id=778331760605528146]
module.discord_simde.module.general.discord_voice_channel.voice: Refreshing state... [id=778331765487960074]
module.discord_simde.module.antoine_cet.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=4264886267]
module.discord_simde.discord_invite.general: Refreshing state... [id=sPnWyht]
module.discord_simde.discord_role.jeffrey: Refreshing state... [id=782684806961561660]
module.discord_simde.discord_role.treso: Refreshing state... [id=777569554539741255]
module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=2801032487]
module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["782684806961561660"]: Refreshing state... [id=2801032487]
module.discord_simde.module.remy_huet.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=334888942]
module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=2713721276]
module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role["777569554539741255"]: Refreshing state... [id=2713721276]
module.discord_simde.module.remy_huet.discord_member_roles.member_role["777569554539741255"]: Refreshing state... [id=334888942]
module.discord_simde.discord_role.payutc: Refreshing state... [id=776093666267758604]
module.discord_simde.module.private-treso.discord_text_channel.text: Refreshing state... [id=777569555114885140]
module.discord_simde.module.private-payutc.discord_category_channel.category: Refreshing state... [id=778331763218972724]
module.discord_simde.discord_role.admin: Refreshing state... [id=759778778212991066]
module.discord_simde.module.private-treso.discord_voice_channel.voice: Refreshing state... [id=778331766838394880]
module.discord_simde.discord_invite.treso: Refreshing state... [id=JHanp36mGb]
module.discord_simde.module.noe_amiot.discord_member_roles.member_role["759778778212991066"]: Refreshing state... [id=1422878723]
module.discord_simde.module.noe_amiot.discord_member_roles.member_role["776093666267758604"]: Refreshing state... [id=1422878723]
module.discord_simde.discord_channel_permission.member_notifications: Refreshing state... [id=3123474663]
module.discord_simde.discord_channel_permission.jeffrey_general: Refreshing state... [id=2855812215]
module.discord_simde.discord_channel_permission.treso_treso: Refreshing state... [id=3264752093]
module.discord_simde.discord_channel_permission.respinfo_notifications: Refreshing state... [id=2712721542]
module.discord_simde.discord_channel_permission.jeffrey_notifications: Refreshing state... [id=4429080]
module.discord_simde.discord_channel_permission.treso_notifications: Refreshing state... [id=3519343031]
module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role["776093666267758604"]: Refreshing state... [id=2314042217]
module.discord_simde.discord_channel_permission.payutc_general: Refreshing state... [id=2210266031]
module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role["759778778212991066"]: Refreshing state... [id=2314042217]
module.discord_simde.discord_channel_permission.respinfo_general: Refreshing state... [id=197882345]
module.discord_simde.discord_channel_permission.games_member: Refreshing state... [id=1359208525]
module.discord_simde.discord_channel_permission.treso_general: Refreshing state... [id=2076131544]
module.discord_simde.discord_channel_permission.payutc_notifications: Refreshing state... [id=700863168]
module.discord_simde.module.cesar_richard.discord_member_roles.member_role["759778778212991066"]: Refreshing state... [id=758910205]
module.discord_simde.module.cesar_richard.discord_member_roles.member_role["776093666267758604"]: Refreshing state... [id=758910205]
module.discord_simde.module.cesar_richard.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=758910205]
module.discord_simde.module.general.discord_channel_permission.member[0]: Refreshing state... [id=2392492197]
module.discord_simde.module.private-treso.discord_channel_permission.admin[0]: Refreshing state... [id=4257400037]
module.discord_simde.module.private-treso.discord_channel_permission.member_denied[0]: Refreshing state... [id=2842734733]
module.discord_simde.module.private-payutc.discord_channel_permission.admin[0]: Refreshing state... [id=413852137]
module.discord_simde.module.private-payutc.discord_channel_permission.member_denied[0]: Refreshing state... [id=1276679553]
module.discord_simde.module.private-payutc.discord_text_channel.text: Refreshing state... [id=776093859746676736]
module.discord_simde.discord_channel_permission.payutc_payutc: Refreshing state... [id=3757225894]
module.discord_simde.module.private-jeffrey.discord_category_channel.category: Refreshing state... [id=782684808395489320]
module.discord_simde.module.private-payutc.discord_voice_channel.voice: Refreshing state... [id=778331769547391037]
module.discord_simde.discord_channel_permission.jeffrey_jeffrey: Refreshing state... [id=3014025369]
module.discord_simde.module.private-woolly.discord_category_channel.category: Refreshing state... [id=783640459279990824]
module.discord_simde.module.private-jeffrey.discord_channel_permission.admin[0]: Refreshing state... [id=1568403726]
module.discord_simde.module.private-jeffrey.discord_text_channel.text: Refreshing state... [id=782684809008775169]
module.discord_simde.module.private-jeffrey.discord_channel_permission.member_denied[0]: Refreshing state... [id=164201830]
module.discord_simde.module.private-admin.discord_category_channel.category: Refreshing state... [id=778331766016049173]
module.discord_simde.module.private-woolly.discord_channel_permission.admin[0]: Refreshing state... [id=2615252176]
module.discord_simde.module.private-woolly.discord_text_channel.text: Refreshing state... [id=783640460572885022]
module.discord_simde.module.private-woolly.discord_channel_permission.member_denied[0]: Refreshing state... [id=3478380728]
module.discord_simde.module.private-jeffrey.discord_voice_channel.voice: Refreshing state... [id=782684810614538311]
module.discord_simde.module.private-admin.discord_channel_permission.member_denied[0]: Refreshing state... [id=3623255403]
module.discord_simde.module.private-admin.discord_channel_permission.admin[0]: Refreshing state... [id=2202274051]
module.discord_simde.module.private-admin.discord_text_channel.text: Refreshing state... [id=759903971316858891]
module.discord_simde.module.private-woolly.discord_voice_channel.voice: Refreshing state... [id=783640463889793055]
module.discord_simde.module.private-admin.discord_voice_channel.voice: Refreshing state... [id=778331771556855838]
module.discord_simde.module.anton42.discord_member_roles.member_role["782684806961561660"]: Refreshing state... [id=2772452286]
module.discord_simde.module.anton42.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=2772452286]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.woolly_general will be created
  + resource "discord_channel_permission" "woolly_general" {
      + allow        = 100764736
      + channel_id   = "778331758302593074"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.woolly_notifications will be created
  + resource "discord_channel_permission" "woolly_notifications" {
      + allow        = 100762688
      + channel_id   = "778636669737369651"
      + deny         = 199937
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.woolly_woolly will be created
  + resource "discord_channel_permission" "woolly_woolly" {
      + allow        = 100764736
      + channel_id   = "783640459279990824"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_role.admin will be updated in-place
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 6 -> 7
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.jeffrey will be updated in-place
  ~ resource "discord_role" "jeffrey" {
        id          = "782684806961561660"
        name        = "Projet Jeffrey"
      ~ position    = 3 -> 4
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.payutc will be updated in-place
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.treso will be updated in-place
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 4 -> 5
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.woolly will be created
  + resource "discord_role" "woolly" {
      + color       = 14737408
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = true
      + name        = "Woolly"
      + permissions = 103924288
      + position    = 3
      + server_id   = "759778767831957535"
    }

Plan: 4 to add, 4 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on github/providers.tf line 2, in provider "github":
   2:   version      = "4.1.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*